/* ************************************************************************************
*								圣芯半导体技术有限公司
*								    www.holychip.cn
*	************************************************************************************
*/
#include "holychip_define.h"
#include "inital.h"


////////////////////////////////////////////////////////////////////////
////////////////////////////	 端口初始化	////////////////////////////
////////////////////////////////////////////////////////////////////////
void inital(void)
{
	ANSELL=0X00;		//0=数字模式，1=模拟模式
	ANSELH=0X00;		//0=数字模式，1=模拟模式
	
	PORTA=0XD0;			//端口初始化电平：1=高电平，0=低电平
	PORTB=0X03;			//端口初始化电平：1=高电平，0=低电平

	TRISA=0X0E;			//端口方向配置：1=输入，0=输出
	TRISB=0X08;			//端口方向配置：1=输入，0=输出
	
	PHCON1=0XF1;		//上拉电阻配置：1=禁止上拉，0=使能上拉
	PHCON=0XFF;			//上拉电阻配置：1=禁止上拉，0=使能上拉   0XDF
	
	PDCON1=0xFF;		//下拉电阻配置：1=禁止下拉，0=使能下拉
	PDCON=0xBF;			//下拉电阻配置：1=禁止下拉，0=使能下拉
	
	
	IOCA=0X00;			//弱上拉配置：0=禁止弱上拉，1=使能弱上拉
	IOCB=0X00;			//弱上拉配置：0=禁止弱上拉，1=使能弱上拉
	
    PBIE=0;				//端口电平变化中断：0=禁止，1=使能
}

////////////////////////////////////////////////////////////////////////
////////////////////////	系统初始化 		////////////////////////////
////////////////////////////////////////////////////////////////////////
void sysinitial(void)
{

	INTECON = 0x00;		//中断控制寄存器清零
	
	OPTION = 0X00;		//时钟预分频配置
//时钟分频对应Timer0
// 000   1:2
// 001   1:4
// 010   1:8
// 011   1:16
// 100   1:32
// 101   1:64
// 110   1:128
// 111   1:256
	
				
	SBIT(INTECON, 0, HIGH);	//使能Timer0中断
	SBIT(INTECON, 3, LOW);	//清除Timer0中断标志位
	SBIT(INTECON, 7, HIGH);	//使能全局中断
		
	SBIT(T1CON, 5, HIGH);	//使能Timer0振荡器

	SBIT(OPTION, 5, LOW);	//时钟源选择：系统时钟Fcpu
	SBIT(OPTION, 4, LOW);	//时钟边沿配置
}

//RAM初始化函数
void ramInitial(void)
{
	FSR=0X3f;				//选择BANK0，初始化RAM区域
	do{
		INDF=0;
		FSR--;
	}while(FSR != 0x0f);
	
	FSR=0Xdf;				//选择BANK1，初始化RAM区域
	do{
		INDF=0;
		FSR--;
	}while(FSR != 0x8f);
}