/*  ************************************************************************************
*								�Ϻ�оʥ���ӹɷ����޹�˾
*								    www.holychip.cn
*	************************************************************************************
*/
#include "holychip_define.h"
#include "PWM.h"
//������������������������������������������������������������������
//��PWM��ʼ��							  						
//��Version:V1.00										 		 
//��Functio:����PWM��ؼĴ���	 						 		 
//������������������������������������������������������������

typedef unsigned char uchar;
typedef unsigned int uint; 


#define u16 unsigned int
#define u8  unsigned char

void T1_PWM_inital(void)
{
	WDTEN=0;		//�ر�WDT
	//OPTION=0X00;	//ʹ�ø�Ƶʱ��
	
	TMR2H=0x40;		//Bit7-6  = 01 ����PB2��ΪTM1PWM�ܽ�  //����PB3��ΪTM2PWM�ܽ�
		
	T1 = 0x68;		//��ʱ�����Ĵ���    
	
	T1LOAD = 123;	//T1���ؼĴ���(250��ֱ��) -> 1kHz @ 8MHz/32
	PWM0P = 0;		//PWM0ռ�ձ����üĴ���(���øߵ�ƽʱ��)
	
	T1CON=0x45;		//��Ƶ��1:1 Fcpu  PWM0E=1;		//����PWM0���,��Ӧ�˿����PWM0�ź�  T1CON��bit6
	
	T1IF=0;
	
	T1EN=1;			//��T1
	T1IE=0;			//T1����ж�ʹ��λ	
	
	T1CR_AUXR = 0;				
}









